benchmarks/results/2026-08-29-709-diagnosis/wrk-host-to-guest-crossmachine/wrk-crossmachine-static.txt
Running 10s test @ http://192.168.86.37:8069/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.38ms    1.21ms  23.24ms   87.05%
    Req/Sec     6.12k   572.81     9.72k    73.00%
  Latency Distribution
     50%    1.01ms
     75%    1.68ms
     90%    2.81ms
     99%    5.94ms
  244704 requests in 10.09s, 135.81MB read
Requests/sec:  24246.16
Transfer/sec:     13.46MB